notes/interesting_resources.org
:PROPERTIES:
:ID:       A8CF27F2-1B1E-4A5B-AB8C-75D301AF82B6
:END:
#+TITLE: Interesting Resources

* Repositories

- flash7even's programming contest [[https://github.com/flash7even/programming-contest][repository]]
- kth-competitive-programming's [[https://github.com/kth-competitive-programming/kactl/blob/main/kactl.pdf][Catalog of algorithms]]
- [[https://github.com/pllk/cphb/][Competitive Programmer's Handbook]]

* Techniques

- Dynamic Programming Optimizations
  - [[https://codeforces.com/blog/entry/8219?f0a28=1][indy256's Dynamic Programming Optimizations]]
  - [[https://www.youtube.com/watch?v=KX_-7AqcnEU][Colin Galen's Dynamic Programming Optimizations (Segment Tree, Convex Hull Trick)]]
- [[https://www.youtube.com/watch?v=RDzsrmMl48I][Colin Galen's The Black Box Method: How to Learn Hard Concepts Quickly]]
- [[https://codeforces.com/blog/entry/45223][SOS Dynamic Programming]] ([[https://ncduy0303.github.io/Competitive-Programming/Dynamic%20Programming/SOS%20DP.cpp][Template]])

* Interview

- [[https://leetcode.com/discuss/general-discussion/239136/coding-interview-the-game-plan][Coding Interview: The Game Plan]]

* How to practice

- [[https://codeforces.com/blog/entry/98806?locale=en][How to practice Competitive Programming By Um_nik]].  Give unbounded time for solving problems and focus on those that are slightly above your level.

- [[https://codeforces.com/blog/entry/91114][My opinion on how to practice competitive programming By Radewoosh]].  Make competitive programming part of your life and practice whenever you can.
