interesting_resources.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Interesting Resources</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">
</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Interesting Resources</h1>

<div id="outline-container-org8bee99e" class="outline-2">
<h2 id="org8bee99e">Repositories</h2>
<div class="outline-text-2" id="text-org8bee99e">
<ul class="org-ul">
<li>flash7even's programming contest <a href="https://github.com/flash7even/programming-contest">repository</a></li>
<li>kth-competitive-programming's <a href="https://github.com/kth-competitive-programming/kactl/blob/main/kactl.pdf">Catalog of algorithms</a></li>
<li><a href="https://github.com/pllk/cphb/">Competitive Programmer's Handbook</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcbc988c" class="outline-2">
<h2 id="orgcbc988c">Techniques</h2>
<div class="outline-text-2" id="text-orgcbc988c">
<ul class="org-ul">
<li>Dynamic Programming Optimizations
<ul class="org-ul">
<li><a href="https://codeforces.com/blog/entry/8219?f0a28=1">indy256's Dynamic Programming Optimizations</a></li>
<li><a href="https://www.youtube.com/watch?v=KX_-7AqcnEU">Colin Galen's Dynamic Programming Optimizations (Segment Tree, Convex Hull Trick)</a></li>
</ul></li>
<li><a href="https://www.youtube.com/watch?v=RDzsrmMl48I">Colin Galen's The Black Box Method: How to Learn Hard Concepts Quickly</a></li>
<li><a href="https://codeforces.com/blog/entry/45223">SOS Dynamic Programming</a> (<a href="https://ncduy0303.github.io/Competitive-Programming/Dynamic%20Programming/SOS%20DP.cpp">Template</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org29420b0" class="outline-2">
<h2 id="org29420b0">Interview</h2>
<div class="outline-text-2" id="text-org29420b0">
<ul class="org-ul">
<li><a href="https://leetcode.com/discuss/general-discussion/239136/coding-interview-the-game-plan">Coding Interview: The Game Plan</a></li>
</ul>
</div>
</div>

<div id="outline-container-org57d4b68" class="outline-2">
<h2 id="org57d4b68">How to practice</h2>
<div class="outline-text-2" id="text-org57d4b68">
<ul class="org-ul">
<li><a href="https://codeforces.com/blog/entry/98806?locale=en">How to practice Competitive Programming By Um<sub>nik</sub></a>.  Give unbounded time for solving problems and focus on those that are slightly above your level.</li>

<li><a href="https://codeforces.com/blog/entry/91114">My opinion on how to practice competitive programming By Radewoosh</a>.  Make competitive programming part of your life and practice whenever you can.</li>
</ul>
</div>
</div>
</div>
</body>
</html>